In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
seri = pd.Series([1,2,3,4])
seri

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
type(seri)

pandas.core.series.Series

In [ ]:
seri.dtype

dtype('int64')

In [ ]:
seri.mean()

2.5

In [ ]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [ ]:
seri.size

4

In [ ]:
seri.ndim

1

In [ ]:
seri.shape

(4,)

In [ ]:
seri.head(2)

0    1
1    2
dtype: int64

In [ ]:
seri.tail(2)

2    3
3    4
dtype: int64

In [ ]:
seri=pd.Series(np.random.randint(3,17,size=20))
seri

0      5
1     14
2      3
3     10
4     12
5      5
6     10
7     13
8     15
9     12
10     5
11    13
12    14
13     4
14    14
15    10
16     4
17     7
18    11
19    11
dtype: int64

In [ ]:
seri = pd.Series(np.random.randint(1,10, size=5))
seri

0    8
1    2
2    2
3    4
4    2
dtype: int64

In [ ]:
seri.index = ["a","b","c","d","e"]
seri

a    8
b    2
c    2
d    4
e    2
dtype: int64

In [ ]:
seri["a":"c"]

a    8
b    2
c    2
dtype: int64

In [ ]:
seri["a"]

8

In [ ]:
seri

a    8
b    2
c    2
d    4
e    2
dtype: int64

In [ ]:
seri[["c","e"]]

c    2
e    2
dtype: int64

In [ ]:
seri1=pd.Series(np.random.randint(3,100,size=5))
seri2=pd.Series(np.random.randint(4,100,size=5))
seri3=pd.concat([seri1,seri2])
seri3

0     3
1    64
2    29
3    69
4    96
0    72
1    78
2    18
3    15
4    32
dtype: int64

In [ ]:
seri1=pd.Series(np.random.randint(3,100,size=5))
seri2=pd.Series(np.random.randint(4,100,size=7))
seri3=pd.concat([seri1,seri2], ignore_index=True)
seri3

0     14
1     13
2     14
3     84
4     91
5     48
6     72
7     41
8     88
9     50
10     5
11    88
dtype: int64

In [ ]:
seri.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
seri.values

array([8, 2, 2, 4, 2])

In [ ]:
seri.keys

<bound method Series.keys of a    8
b    2
c    2
d    4
e    2
dtype: int64>

In [ ]:
list(seri.items())

[('a', 8), ('b', 2), ('c', 2), ('d', 4), ('e', 2)]

In [ ]:
8 in seri.values

True

In [ ]:
"a" in seri

True

In [ ]:
"g" in seri

False

In [ ]:
sozluk = {"Hello":"Merhaba", "Age":"Yaş", "Computer":"Bilgisayar"}
seri= pd.Series(sozluk)
seri

Hello          Merhaba
Age                Yaş
Computer    Bilgisayar
dtype: object

In [ ]:
seri.values

array(['Merhaba', 'Yaş', 'Bilgisayar'], dtype=object)

In [ ]:
seri.keys

<bound method Series.keys of Hello          Merhaba
Age                Yaş
Computer    Bilgisayar
dtype: object>

In [ ]:
list(seri.items())

[('Hello', 'Merhaba'), ('Age', 'Yaş'), ('Computer', 'Bilgisayar')]

In [ ]:
seri=pd.Series(np.arange(1,10,2))
seri

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [ ]:
seri.mean()

5.0

In [ ]:
seri.std()

3.1622776601683795

In [ ]:
seri.median()

5.0

In [ ]:
seri=pd.Series(np.random.randint(3,100, size= 9))
seri

0    56
1    49
2    44
3    36
4     5
5    18
6    85
7    97
8    32
dtype: int64

In [ ]:
seri.mean()

28.875

In [ ]:
seri.median()

44.0

In [ ]:
seri.sort_values()

4     5
5    18
8    32
3    36
2    44
1    49
0    56
6    85
7    97
dtype: int64

In [ ]:
seri.median()

44.0

In [ ]:
df=pd.DataFrame(np.random.randint(1,100,size=10), columns=["Değer"])
df

   Değer
0     25
1     73
2     75
3     10
4     98
5     82
6     99
7     44
8     37
9     81

In [ ]:
df1=pd.DataFrame(np.random.randint(1,100,size=(3,4)))
df1

    0   1   2   3
0  62  72  76  24
1  89  28  35  21
2  49  80  70  78

In [ ]:
df2=pd.DataFrame(np.random.randint(1,100,size=(4,5)),index=["a","b","c","d"], columns=["deg1","deg2","deg3","deg4","deg5"])
df2

   deg1  deg2  deg3  deg4  deg5
a     1    44    26    33    64
b    70    41    14    88    20
c    94    65     6    52    11
d    49    36    83    81    19

In [ ]:
type(df2)

pandas.core.frame.DataFrame

In [ ]:
df2.dtypes

deg1    int64
deg2    int64
deg3    int64
deg4    int64
deg5    int64
dtype: object

In [ ]:
df2.axes

[Index(['a', 'b', 'c', 'd'], dtype='object'),
 Index(['deg1', 'deg2', 'deg3', 'deg4', 'deg5'], dtype='object')]

In [ ]:
df2.size

20

In [ ]:
df2.shape

(4, 5)

In [ ]:
df2.ndim

2

In [ ]:
df2.values

array([[ 1, 44, 26, 33, 64],
       [70, 41, 14, 88, 20],
       [94, 65,  6, 52, 11],
       [49, 36, 83, 81, 19]])

In [ ]:
df2

   deg1  deg2  deg3  deg4  deg5
a     1    44    26    33    64
b    70    41    14    88    20
c    94    65     6    52    11
d    49    36    83    81    19

In [ ]:
df2.head(3)

   deg1  deg2  deg3  deg4  deg5
a     1    44    26    33    64
b    70    41    14    88    20
c    94    65     6    52    11

In [ ]:
df2.tail(2)

   deg1  deg2  deg3  deg4  deg5
c    94    65     6    52    11
d    49    36    83    81    19

In [ ]:
s1=np.random.randint(1,100,size=5)
s2=np.random.randint(1,100,size=5)
s3=np.random.randint(1,100,size=5)

In [ ]:
df=pd.DataFrame(number,index=[list("abcde")])

   var1  var2  var3
a    76    82    28
b    84     5    23
c    58    21    64
d    92    48    25
e    84     5    91

In [ ]:
df.mean()

var1    78.8
var2    32.2
var3    46.2
dtype: float64

In [ ]:
df["var1"].mean()

78.8

In [ ]:
import seaborn as sbn

In [ ]:
df

   var1  var2  var3
a    76    82    28
b    84     5    23
c    58    21    64
d    92    48    25
e    84     5    91

In [ ]:
df.iloc[0]

var1    76
var2    82
var3    28
Name: (a,), dtype: int64

In [ ]:
df.iloc[[0]]

   var1  var2  var3
a    76    82    28

In [ ]:
df

   var1  var2  var3
a    76    82    28
b    84     5    23
c    58    21    64
d    92    48    25
e    84     5    91

In [ ]:
df.loc["d"]

   var1  var2  var3
d    92    48    25

In [ ]:
df.iloc[2:4,1:3]

   var2  var3
c    21    64
d    48    25

In [ ]:
df.loc["c":"d","var2":"var3"]

   var2  var3
c    21    64
d    48    25

In [ ]:
df.isnull()

    var1   var2   var3
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False
e  False  False  False

In [ ]:
df.isnull().value_counts()

var1   var2   var3
False  False  False    5
dtype: int64

In [ ]:
df

   var1  var2  var3
a    76    82    28
b    84     5    23
c    58    21    64
d    92    48    25
e    84     5    91

In [12]:
df=pd.DataFrame(np.random.randint(1,100, size=(3,5)),index= ["deg1","deg2","deg3",], columns=["var1","var2","var3","var4","var5"])
df

      var1  var2  var3  var4  var5
deg1    98    50    57    80    60
deg2    16    28    49    27    22
deg3     7    54    33    56    45

In [10]:
import numpy as np
import pandas as pd

In [13]:
df.loc["deg2"].sum()

142

In [17]:
df.loc[::,"var3"].sum()

139

In [ ]:
df.iloc[1,1]

17

In [ ]:
df.iloc[2,2]

53

In [ ]:
df

      var1  var2  var3  var4  var5
deg1    11    14    23    15    28
deg2    27    17    81    35    95
deg3    54    30    53    26    61

In [ ]:
df.drop("deg1", axis=0)

      var1  var2  var3  var4  var5
deg2    27    17    81    35    95
deg3    54    30    53    26    61

In [1]:
import numpy as np
import pandas as pd
num1=np.random.randint(1,20,size=(3,6))
num2=np.random.randint(1,20,size=(3,5))
num3=np.concatenate((num1,num2),axis=1)
df=pd.DataFrame(num3, index=["satir satir2 satir3".split()], columns=[list("abcdefghjkl")])
df

         a   b   c   d   e   f   g  h   j  k   l
satir   15  10   6  19   2  16  11  8  13  1   7
satir2   7  12   8  13  17  15   9  8   3  6   7
satir3   5   1  17  19   3   5  19  5  10  3  17

In [2]:
df.iloc[1,2]

8

In [3]:
df.loc["satir","c"]

       c
satir  6

In [4]:
df.drop("satir")

        a   b   c   d   e   f   g  h   j  k   l
satir2  7  12   8  13  17  15   9  8   3  6   7
satir3  5   1  17  19   3   5  19  5  10  3  17

In [5]:
df.drop("h", axis=1)

         a   b   c   d   e   f   g   j  k   l
satir   15  10   6  19   2  16  11  13  1   7
satir2   7  12   8  13  17  15   9   3  6   7
satir3   5   1  17  19   3   5  19  10  3  17

In [18]:
df[df>15]

      var1  var2  var3  var4  var5
deg1  98.0    50    57    80    60
deg2  16.0    28    49    27    22
deg3   NaN    54    33    56    45

In [27]:
df=pd.DataFrame(np.random.randint(1,100,size=(5,4)))
df

    0   1   2   3
0  73  27  47  86
1  86  62  79  41
2  84  12  82  62
3  16  82  25  96
4   6  73  16  71

In [30]:
df[df[1:2]>45]

      0     1     2   3
0   NaN   NaN   NaN NaN
1  86.0  62.0  79.0 NaN
2   NaN   NaN   NaN NaN
3   NaN   NaN   NaN NaN
4   NaN   NaN   NaN NaN

In [31]:
df

    0   1   2   3
0  73  27  47  86
1  86  62  79  41
2  84  12  82  62
3  16  82  25  96
4   6  73  16  71

In [38]:
df[df[3]>63]

    0   1   2   3
0  73  27  47  86
3  16  82  25  96
4   6  73  16  71

In [43]:
df1=pd.DataFrame({"çalışanlar":["Ali","Veli","Mahmut"], "işe_başlama":[2019,2020,20201]})
df2=pd.DataFrame({"çalışanlar":["Ali","Veli","Mahmut"], "departman":["IK","IT","Muhasebe"]})

  çalışanlar  işe_başlama
0        Ali         2019
1       Veli         2020
2     Mahmut        20201

In [44]:
df2

  çalışanlar departman
0        Ali        IK
1       Veli        IT
2     Mahmut  Muhasebe

In [45]:
pd.merge(df1,df2)

  çalışanlar  işe_başlama departman
0        Ali         2019        IK
1       Veli         2020        IT
2     Mahmut        20201  Muhasebe

In [46]:
df3=pd.merge(df1,df2)
df3

  çalışanlar  işe_başlama departman
0        Ali         2019        IK
1       Veli         2020        IT
2     Mahmut        20201  Muhasebe

In [47]:
df4=pd.DataFrame({"grup":["Mühendis","IT_Uzman","Çaycı"], "çalışanlar":["Ali","Veli","Mahmut"]})
df4

       grup çalışanlar
0  Mühendis        Ali
1  IT_Uzman       Veli
2     Çaycı     Mahmut

In [48]:
pd.merge(df3,df4)

  çalışanlar  işe_başlama departman      grup
0        Ali         2019        IK  Mühendis
1       Veli         2020        IT  IT_Uzman
2     Mahmut        20201  Muhasebe     Çaycı